/* Задача 1: Напишите программу, которая принимает на
вход трёхзначное число и на выходе показывает вторую
цифру этого числа.*/

Console.Write("Введите трехзначное число > ");
string[] arrow = {Console.ReadLine()};
Console.Write("Вторая цифра этого числа: " + arrow[0][1]);
